[
  {
    "id": 1,
    "name": "Squat",
    "description": "A lower body exercise where you bend your knees and lower your body",
    "targetMuscles": ["Quadriceps", "Hamstrings", "Glutes"],
    "difficulty": "Beginner",
    "instructions": "Stand with feet shoulder-width apart. Lower your body by bending your knees until your thighs are parallel to the ground. Push back up to the starting position."
  },
  {
    "id": 2,
    "name": "Push-up",
    "description": "An upper body exercise using your own body weight",
    "targetMuscles": ["Chest", "Shoulders", "Triceps"],
    "difficulty": "Beginner",
    "instructions": "Start in a plank position with hands shoulder-width apart. Lower your body until your chest nearly touches the ground. Push back up to the starting position."
  },
  {
    "id": 3,
    "name": "Lunge",
    "description": "A lower body exercise that targets one leg at a time",
    "targetMuscles": ["Quadriceps", "Glutes", "Hamstrings"],
    "difficulty": "Beginner",
    "instructions": "Step forward with one leg and lower your body until both knees are bent at a 90-degree angle. Push back to the starting position and repeat with the other leg."
  },
  {
    "id": 4,
    "name": "Plank",
    "description": "A core strengthening exercise where you hold a static position",
    "targetMuscles": ["Core", "Shoulders", "Back"],
    "difficulty": "Beginner",
    "instructions": "Start in a plank position with forearms on the ground. Keep your body in a straight line from head to heels. Hold this position for as long as possible."
  },
  {
    "id": 5,
    "name": "Burpee",
    "description": "A full-body exercise combining a squat, push-up, and jump",
    "targetMuscles": ["Full Body"],
    "difficulty": "Intermediate",
    "instructions": "Start standing. Drop into a squat position and place your hands on the ground. Jump or step your feet back into a plank position. Do a push-up. Jump your feet back to the squat position. Jump up with your hands overhead."
  },
  {
    "id": 6,
    "name": "Jumping Jack",
    "description": "A cardio exercise where you jump while spreading your legs and raising your arms",
    "targetMuscles": ["Full Body", "Cardio"],
    "difficulty": "Beginner",
    "instructions": "Stand with feet together and arms at your sides. Jump while spreading your feet shoulder-width apart and raising your arms above your head. Jump back to the starting position with feet together and arms at your sides."
  }
]
